{
  "sections": {
    "main": {
      "type": "main-article-suit-sections-20220223pm0335",
      "blocks": {
        "0ae71f40-edd2-4eae-8e39-c8dc0fecfb44": {
          "type": "image_text_block",
          "settings": {
            "image": "shopify:\/\/shop_images\/article-20210108-user-comment-img_4bdf3174-3d2e-4122-a11f-71fa3d4b81e2.jpg",
            "text_message": "“I really have no dislikes about the bike. If you want a cool ride that is built tough get one and try it this may be what you were looking for.”",
            "text1": "Will",
            "text2": "- FROM US -",
            "text3": "October 7,2020"
          }
        },
        "2f5077ea-042f-4b85-9cc1-78fbf202bfbb": {
          "type": "text_image_text_v",
          "settings": {
            "title": "1. Battery Life",
            "richtext1": "<p>The battery of the Nakto Super Cruiser is a 48V lithium-ion battery. For those that don't know much about batteries, you need only know that this is powerful enough to keep you out on a long ride without any worry about your ebike battery dying and leaving you stressed out and stranded somewhere far from home.<\/p>",
            "image": "shopify:\/\/shop_images\/article-20210108-battery-life-img_520e798c-0c2c-4d3d-aa71-17e7b8b06ffd.jpg",
            "richtext2": "<p>For those more interested in batteries, the lithium-ion battery type is much better than lead acid varieties as it is generally much more reliable and durable, meaning you won't have to change your battery regularly as you might have to with a lead acid variety. This helps to keep running costs low!<\/p>"
          }
        },
        "260453f8-0860-4196-acc4-617c04f9796c": {
          "type": "text_image_text_v",
          "settings": {
            "title": "2. Front Suspension Fork",
            "richtext1": "<p>Keen cyclists will already be grinning at this feature, but if you're less familiar with suspension systems of ebikes we'll break it down a little. A front suspension fork will essentially take all of the force from a bumpy trail, so that you don't have to feel it. It will absorb the shocks that come with riding on mountain trails and roads alike, and make the riding experience that much more streamlined and comfortable.<\/p>",
            "image": "shopify:\/\/shop_images\/article-20210108-front-suspension-fork-img_2b251cce-3156-43ee-acb9-8da6e8c8b68b.jpg",
            "richtext2": "<p>This is a welcome feature on a fat tire ebike because their ability to ride anywhere is one of its main selling points, so a suspension system that supports that is vital. Thankfully, the Nakto Super Cruiser does not overlook that fact!<\/p>"
          }
        },
        "ae2ea971-cb91-44aa-b4cb-6b6bb060035e": {
          "type": "text_image_text_v",
          "settings": {
            "title": "3. 500W Brush-Less Motor",
            "richtext1": "<p>Now if you don't keep up with the motor varieties available for ebikes, those words are pretty meaningless. But, if we told you that you typically see a motor with around 250W at the $1200 price point, then you'd probably be interested. The CZJB 500W brush-less motor on offer here is powerful! It can get you up steeper inclines than a 250W motor would, meaning you don't ever have to face a part of the trail that you can't access again. This is great for those adventurers out there who want to explore every nook and cranny. Even if you stick to the roads though, a more powerful motor will feel much more comfortable to ride.<\/p>",
            "image": "shopify:\/\/shop_images\/article-20210108-500w-brush-less-motor-img_6dcda0d7-e2ba-4a46-a926-8162b2add32c.jpg",
            "richtext2": ""
          }
        },
        "92d13e1c-62bc-44c6-aaa8-d1baf1bb7eed": {
          "type": "text_image_text_v",
          "settings": {
            "title": "4. Design",
            "richtext1": "<p>OK, now for the bit you've really been waiting for the design. Yes, all that technical mumbo jumbo above is really impressive, but you're probably not going to care about any of that if the ebike doesn't look good. Well, we're happy to report that the Nakto Super Cruiser is stunning.<\/p>",
            "image": "shopify:\/\/shop_images\/article-20210108-design-img_1ac817da-c217-4eb1-b80e-ef5539084b7d.jpg",
            "richtext2": "<p>It does only come in one color variety, so if that is something that might bother you it is worth pointing out. Still, it's matte black finish is sleek and stylish and it will catch the eye of every other cyclist on the trail! We think you'll struggle to find an alternative that looks this good for only $1200.<\/p>"
          }
        },
        "63bff0cd-7eca-4ee6-9dea-159e00b67865": {
          "type": "text_2imagesH_text_v",
          "settings": {
            "title": "5. Safety Is A Priority At Nakto",
            "richtext1": "<p>The team there have really put together a bike that performs expertly, but remains incredibly safe. They recognize the importance of a fat tire ebike to be able to perform safely across all terrain, and they tested the Nakto Super Cruiser stringently to make sure that it was safe.<\/p>",
            "image1": "shopify:\/\/shop_images\/article-20210108-safety-img1_691b6aca-8b49-4e37-a564-e39323151d56.jpg",
            "image2": "shopify:\/\/shop_images\/article-20210108-safety-img2_917a4493-48e1-42eb-822e-62ea4bd992bd.jpg",
            "richtext2": "<p>It's disc brake system is unparalleled and works in all weather conditions on mountain trails and roads alike, and the ebike even comes with a headlight as standard for those late night or early morning rides!<\/p><p>Safety is important with every bike, so it's good to see Nakto making it a<br\/>priority here.<\/p>"
          }
        }
      },
      "block_order": [
        "0ae71f40-edd2-4eae-8e39-c8dc0fecfb44",
        "2f5077ea-042f-4b85-9cc1-78fbf202bfbb",
        "260453f8-0860-4196-acc4-617c04f9796c",
        "ae2ea971-cb91-44aa-b4cb-6b6bb060035e",
        "92d13e1c-62bc-44c6-aaa8-d1baf1bb7eed",
        "63bff0cd-7eca-4ee6-9dea-159e00b67865"
      ],
      "settings": {
        "image": "shopify:\/\/shop_images\/article-20210108-banner-img_f1c37c11-96fc-44db-9aaa-c7ea210dffd9.jpg",
        "post_title": "Why the Nakto Super Cruiser is so impressive?",
        "pub_date": "2022-2-23",
        "author": "Nathan L",
        "brief": ""
      }
    }
  },
  "order": [
    "main"
  ]
}
